<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest FireAMP release.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.download.FireAMP</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FireAMP Mac Connector</string>
        <key>DOWNLOAD_URL</key>
        <string>https://console.amp.sourcefire.com/install_packages/b181cac7-42d7-49e1-8c99-b2d2079a81f3/download?product=MacProduct</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
